; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v1 - type_2 ?v6 - type_3)
 	      (pred_4 ?v8 - object ?v6 - type_3)
	      (pred_1 ?v1 - type_2 ?v3 - type_1)
	      (pred_2 ?v1 - type_2 ?v8 - object ?v3 - type_1))

   (:action op_1
       :parameters  (?v1 - type_2 ?v5 ?v2 - type_3)
       :precondition (and  (pred_3 ?v1 ?v5))
       :effect (and  (pred_3 ?v1 ?v2)
		     (not (pred_3 ?v1 ?v5))))

   (:action op_3
       :parameters (?v1 - type_2 ?v4 - object ?v7 - type_3 ?v3 - type_1)
       :precondition  (and  (pred_4 ?v4 ?v7) (pred_3 ?v1 ?v7) (pred_1 ?v1 ?v3))
       :effect (and (pred_2 ?v1 ?v4 ?v3)
		    (not (pred_4 ?v4 ?v7)) 
		    (not (pred_1 ?v1 ?v3))))

   (:action op_2
       :parameters (?v1 - type_2 ?v4 - object ?v7 - type_3 ?v3 - type_1)
       :precondition  (and  (pred_2 ?v1 ?v4 ?v3) (pred_3 ?v1 ?v7))
       :effect (and (pred_4 ?v4 ?v7)
		    (pred_1 ?v1 ?v3)
		    (not (pred_2 ?v1 ?v4 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_14 obj_09 - type_2
obj_02 obj_13 obj_06 obj_01 - type_1
obj_04 obj_11 obj_07 obj_12 - type_3
obj_03 obj_05 obj_10 obj_08 - object)
(:init
(pred_3 obj_14 obj_12)
(pred_1 obj_14 obj_02)
(pred_1 obj_14 obj_13)
(pred_3 obj_09 obj_07)
(pred_1 obj_09 obj_06)
(pred_1 obj_09 obj_01)
(pred_4 obj_03 obj_12)
(pred_4 obj_05 obj_11)
(pred_4 obj_10 obj_07)
(pred_4 obj_08 obj_11)
)
(:goal
(and
(pred_4 obj_03 obj_07)
(pred_4 obj_05 obj_11)
(pred_4 obj_10 obj_04)
(pred_4 obj_08 obj_07)
)
)

(:constraints
  (always (not (pred_3 obj_14 obj_07)))
)
)

; plan
1. (op_3 obj_14 obj_03 obj_12 obj_13)
   deleted: (pred_4 obj_03 obj_12) (pred_1 obj_14 obj_13)
   added: (pred_2 obj_14 obj_03 obj_13)
   goals met: 1 of 4
2. (op_3 obj_09 obj_10 obj_07 obj_01)
   deleted: (pred_4 obj_10 obj_07) (pred_1 obj_09 obj_01)
   added: (pred_2 obj_09 obj_10 obj_01)
   goals met: 1 of 4
3. (op_1 obj_09 obj_07 obj_04)
   deleted: (pred_3 obj_09 obj_07)
   added: (pred_3 obj_09 obj_04)
   goals met: 1 of 4
4. (op_1 obj_14 obj_12 obj_11)
   deleted: (pred_3 obj_14 obj_12)
   added: (pred_3 obj_14 obj_11)
   goals met: 1 of 4
5. (op_2 obj_09 obj_10 obj_04 obj_01)
   deleted: (pred_2 obj_09 obj_10 obj_01)
   added: (pred_4 obj_10 obj_04) (pred_1 obj_09 obj_01)
   goals met: 2 of 4
6. (op_2 obj_14 obj_03 obj_11 obj_13)
   deleted: (pred_2 obj_14 obj_03 obj_13)
   added: (pred_4 obj_03 obj_11) (pred_1 obj_14 obj_13)
   goals met: 2 of 4
7. (op_1 obj_09 obj_04 obj_11)
   deleted: (pred_3 obj_09 obj_04)
   added: (pred_3 obj_09 obj_11)
   goals met: 2 of 4
8. (op_3 obj_09 obj_08 obj_11 obj_01)
   deleted: (pred_4 obj_08 obj_11) (pred_1 obj_09 obj_01)
   added: (pred_2 obj_09 obj_08 obj_01)
   goals met: 2 of 4
9. (op_1 obj_09 obj_11 obj_07)
   deleted: (pred_3 obj_09 obj_11)
   added: (pred_3 obj_09 obj_07)
   goals met: 2 of 4
10. (op_2 obj_09 obj_08 obj_07 obj_01)
   deleted: (pred_2 obj_09 obj_08 obj_01)
   added: (pred_4 obj_08 obj_07) (pred_1 obj_09 obj_01)
   goals met: 3 of 4
11. (op_1 obj_09 obj_07 obj_11)
   deleted: (pred_3 obj_09 obj_07)
   added: (pred_3 obj_09 obj_11)
   goals met: 3 of 4
12. (op_3 obj_09 obj_03 obj_11 obj_01)
   deleted: (pred_4 obj_03 obj_11) (pred_1 obj_09 obj_01)
   added: (pred_2 obj_09 obj_03 obj_01)
   goals met: 3 of 4
13. (op_1 obj_09 obj_11 obj_07)
   deleted: (pred_3 obj_09 obj_11)
   added: (pred_3 obj_09 obj_07)
   goals met: 3 of 4
14. (op_2 obj_09 obj_03 obj_07 obj_01)
   deleted: (pred_2 obj_09 obj_03 obj_01)
   added: (pred_4 obj_03 obj_07) (pred_1 obj_09 obj_01)
   goals met: 4 of 4
